#=======================================================================================================

#初回起動時の構成
execute as @e[tag=ui_based] run function ui:tmw/246/sp/setup

#=======================================================================================================

#各ベースごとの通常処理
execute as @e[tag=ui_base] run function ui:tmw/246/sp/base_control

#=======================================================================================================

#ダンジョンパーツ破壊遅延
scoreboard players add @e[tag=ui_d,tag=ui_d_dcheckd] ui_death_dt 1
tag @e[tag=ui_d,tag=ui_d_dcheckd,scores={ui_death_dt=10..}] remove ui_d_dcheckd

#=======================================================================================================

#設置
execute as @e[tag=ui_sp] run function ui:tmw/246/sp/summon

#=======================================================================================================
